      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.

       01  valor_ingresar PIC 9(3).
       01  valor_sumar PIC 9(3).
       01  resultado PIC 9(3).

       PROCEDURE DIVISION.

       SUMAR SECTION.
           DISPLAY "resulatado ".
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
